<?php

namespace Database\Seeders;

use App\Models\News;
use App\Models\User;
use Illuminate\Database\Seeder;

class NewsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run(User $user)
    {
        $newsList = [
            [
                'id' => 1,
                'title' => 'Помер співзасновник Slipknot Джої Джордісон',
                'content' => 'Колишній барабанщик американського хеві-метал гурту Slipknot Джої Джордісон помер у 46 років.

У заяві родини Джордісона йдеться, що він мирно помер уві сні.

Члени родини не повідомили причину його смерті, але заявили, що вона залишила їх "з порожніми серцями і почуттям невимовного смутку".

Джордісон був одним з перших учасників Slipknot. Він заснував гурт в 1995 році разом з перкусіоністом Шоном Креханом і басистом Полом Греєм.

Через чотири роки гурт випустив успішний однойменний дебютний альбом.
Slipknot продав мільйони альбомів по всьому світу, досяг успіху в американських чартах і отримав премію Греммі.

Цей гурт відомий своїм унікальним агресивним музичним стилем і носінням масок у стилі фільмів жахів під час виступів.

Джордісон залишався частиною гурту до 2013 року. Пізніше він повідомив, що пішов після того, як йому поставили діагноз поперечний мієліт - форма розсіяного склерозу.
Натан Джонас Джордісон народився в 1975 році у Де-Мойні, штат Айова. Джордісон розповідав, що першу барабанну установку йому подарували батьки, коли йому було вісім років.

Більше він світ музики не залишав, і врешті приєднався до проєкту під назвою Pale Ones в 1995 році, який у підсумку став гуртом Slipknot.

Джордісон сформував і домігся успіху з кількома іншими гуртами, зокрема, Murderdolls, а потім виступав з іншими відомими гуртами - Metallica, Korn і Rob Zombie.

Його смерть настала трохи більше ніж через десять років після смерті одного із співзасновників Slipknot Пола Грея, який помер від передозування наркотиків у 2010 році.

Шанувальники та музиканти тепло згадують Джої Джордісона в соціальних мережах після новини про його смерть.

Серж Танкян з System of a Down назвав його "приголомшливим барабанщиком та фантастичною людиною".

Корі Тейлор, провідний вокаліст Slipknot, розмістив чорні зображення у своїх акаунтах у соціальних мережах після того, як стало відомо про смерть Джордісона.',
                'foto' => 'https://ichef.bbci.co.uk/news/800/cpsprodpb/486E/production/_119624581_gettyimages-805159018.jpg.webp',
                'user_id' => $user->id,
                'publish' => true,
                'slug' => 'pomer-spivzasnovnik-slipknot-dzoyi-dzordison',
            ],
            [
                'id' => 2,
                'title' => 'Де Хеа - про улюблені гурти: подобаються Slipknot, System of a Down, Bullet for My Valentine',
                'content' => 'Голкіпер «Манчестер Юнайтед» Давид де Хеа розповів про свою любов до важкої музики. «Все почалося ще у дитинстві. Я проводив літо з батьками в Аліканті. Там були хлопці трохи старші, які слухали таку музику, та й я слухав разом з ними. Мені подобається рок і хеві-метал. Він мене мотивує. Мені подобаються Slipknot, Avenged Sevenfold, System of a Down, Bullet for My Valentine. Взагалі мені подобається все потроху. Все, що може спасти на думку, наприклад, Френк Сінатра. Мені також подобається іспанська музика. Я можу слухати будь що. Чи добрий я танцюрист? Ну, не найгірший, з огляду на моє зростання. У мене непогане відчуття ритму. Звичайно, я не Майкл Джексон, але дуже непоганий... Добре танцюю на загальному, гідному рівні», — цитує де Хеа сайт УЄФА.',
                'foto' => 'https://s5o.ru/storage/simple/ru/edt/54/3f/d0/a5/ruee819a49e8c.jpg',
                'user_id' => $user->id,
                'publish' => true,
                'slug' => 'de-xea-pro-ulyubleni-gurti-podobayutsya-slipknot-system-of-a-down-bullet-for-my-valentine',
            ]

        ];

        foreach ($newsList as $news) {
            News::factory()->create($news);
        }
    }
}
